html/8_Pointers.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-12-18 Fri 19:27 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>8. Pointers</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Paul Gribble" />
<link rel="stylesheet" type="text/css" href="mystyle.css" /></head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="http://www.gribblelab.org/CBootCamp/index.html"> UP </a>
 |
 <a accesskey="H" href="http://www.gribblelab.org/CBootCamp/index.html"> HOME </a>
</div><div id="content">
<h1 class="title">8. Pointers</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">Pointers</a>
<ul>
<li><a href="#orgheadline2">Declaring a pointer</a></li>
<li><a href="#orgheadline3">Dereferencing a Pointer</a></li>
<li><a href="#orgheadline4">Pointers and Arrays</a></li>
<li><a href="#orgheadline5">Pointer to a struct</a></li>
<li><a href="#orgheadline6">Pointers to Functions</a></li>
<li><a href="#orgheadline7">Function Arguments: Passing By Value vs Passing By Reference</a></li>
</ul>
</li>
<li><a href="#orgheadline8">Dynamically Allocated Memory</a>
<ul>
<li><a href="#orgheadline9">Allocating memory using <code>malloc()</code> or <code>calloc()</code></a></li>
<li><a href="#orgheadline10">Resizing a variable using <code>realloc()</code></a></li>
<li><a href="#orgheadline11">Freeing a memory block using <code>free()</code></a></li>
</ul>
</li>
<li><a href="#orgheadline12">Links</a></li>
<li><a href="#orgheadline13">Exercises</a>
<ul>
<li><a href="#orgheadline14">Solutions</a></li>
</ul>
</li>
</ul>
</div>
</div>
<hr  />

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Pointers</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
Pointers represent one of the more powerful features of the C
language, but also one of the most feared. Some of this fear and
apprehension stems from the ridiculously obtuse ways that pointers
<b>may</b> be used in C. Often tutorials and courses on C approach teaching
pointers by asking the student to decipher bizarre looking pointer
syntax combinations that truthfully are rarely used in practice. You
may have seen bizarre looking pointer syntax, (and you may see it
again), but typically, pointers do not have to be used in a horribly
complicated way. Typically pointers are pretty straightforward.
</p>

<p>
The bottom line is, pointers allow you to work with dynamically
allocated memory blocks. You will use pointers to deal with variables
that have been allocated on the <b>heap</b>. (You can use pointers to deal
with stack variables, but in most cases this just isn't necessary).
</p>

<p>
The basic idea is, a <b>pointer</b> is a special data type in C, that
contains an <b>address</b> to a location in memory. Think of a pointer as
an arrow that points to the location of a block of memory that in turn
contains actual data of interest. It's not unlike the concept of a
phone number, or a house address.
</p>

<p>
The purpose of pointers is to allow you to manually, directly access a
block of memory. Pointers are used a lot for <b>strings</b> and
<b>structs</b>. It's not difficult to imagine that passing the <b>address</b> of
a large block of memory (such as a struct that contains many things)
to a function, is more efficient than making a copy of it and passing
in that copy, only to delete that copy when your function is done with
it. This is known as <b>passing by reference</b> versus <b>passing by
value</b>. There is a code example below that illustrates this more
clearly.
</p>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">Declaring a pointer</h3>
<div class="outline-text-3" id="text-orgheadline2">
<p>
Here is how to declare a pointer:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">argc</span>, <span style="color: #228b22;">char</span> *<span style="color: #a0522d;">argv</span>[])
{
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">age</span> = 30;
  <span style="color: #228b22;">int</span> *<span style="color: #a0522d;">p</span>;
  p = &amp;age;
  printf(<span style="color: #8b2252;">"age=%d\n"</span>, age);
  printf(<span style="color: #8b2252;">"p=%p\n"</span>, p);
  printf(<span style="color: #8b2252;">"*p=%d\n"</span>, *p);
  printf(<span style="color: #8b2252;">"sizeof(p)=%ld\n"</span>, <span style="color: #a020f0;">sizeof</span>(p));
  *p = 40;
  printf(<span style="color: #8b2252;">"*p=%d\n"</span>, *p);
  printf(<span style="color: #8b2252;">"age=%d\n"</span>, age);
  <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
age=30
p=0x7fff197ceb1c
*p=30
sizeof(p)=8
*p=40
age=40
</pre>

<p>
On line 5 we declare an <code>int</code> variable <code>age</code> and initialize it to
<code>30</code>. On line 6 we declare a variable <code>p</code> whose type is a <b>pointer to
an int</b>. The star * syntax is how to declare the type as a pointer
<b>to</b> a particular other type. Usually you need to declare pointers as
pointing to a particular type, but the exception is a so-called <b>void</b>
pointer, which is a pointer to an unknown type. Don't worry about void
pointers for now.
</p>

<p>
So we have a pointer variable <code>p</code> that is a pointer to an <code>int</code>. So
far, it doesn't point anywhere&#x2026; we have only declared that we want a
space in memory to hold a pointer to an int. On line 7 is where we
assign a value to our pointer <code>p</code>. We assign to <code>p</code> the <b>address</b> (the
location) of the other variable <code>age</code>. So now at this point in the
program, we have the following (which we can see in the output):
</p>

<ul class="org-ul">
<li>the value of <code>age</code> is the integer <code>30</code></li>
<li>the value of <code>p</code> is the address of the <code>age</code> variable</li>
<li>the integer that <code>p</code> points to has a value of <code>30</code></li>
</ul>

<p>
On line 2 of the output we see that the value of the <code>p</code> pointer is a
long strange looking string of letters and numbers. This is in fact a
<a href="http://en.wikipedia.org/wiki/Hexadecimal">hexidecimal</a> (base 16) <b>memory address</b>.
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">Dereferencing a Pointer</h3>
<div class="outline-text-3" id="text-orgheadline3">
<p>
On line 10, we see how to access the <b>value</b> that a pointer points to,
by using the star * syntax. So <code>p</code> is the address of an <code>int</code>, whereas
<code>*p</code> is the value of the <code>int</code> that <code>p</code> points to. Accessing the value
that a pointer points to is called <b>dereferencing</b> a pointer.
</p>

<p>
Finally, on line 11 (and on the last line of the output) we can see
that our pointer <code>p</code> is 8 bytes. Remember, there are 8 bits in a byte,
so a 4-byte pointer can hold up to 32 bits, or \(2^{32}\) distinct values,
i.e. \(2^{32}\) distinct addresses in memory. So 32-bit pointers allow us
to access up to 4 gigabytes (4 GB) of memory. If you want to use more
than 4 GB of memory you will need bigger pointers! On 64-bit systems,
pointers are 8 bytes, which allows for \(2^{64}\) distinct addresses in
memory. It will be a <b>long time</b> before your computer has that much
RAM (16 <a href="http://en.wikipedia.org/wiki/Exabyte">exabytes</a> in principle, which is 1 billion gigabytes or 1
million terabytes).
</p>

<p>
Take note of what happens in the code example above on line 12 of the
code listing, and the values output on lines 5 and 6 of the output. On
line 12 of the code listing, we use pointer dereferencing to set the
value of the variable <b>pointed to by p</b> to <code>40</code>. Since <code>p</code> points to
the <code>age</code> variable, we are setting the value of the address in memory
corresponding to the <code>age</code> variable to <code>40</code>.
</p>
</div>
</div>
