org/8_Pointers.org
** Pointers and Arrays

When you declare an array using an expression like =int vec[5];=, what
is really happening behind the scenes, is that a block of memory is
being allocated (on the stack in this case) large enough to hold 5
integers, and the =vec= variable is a pointer that points to the first
element in the array. When you index into the array with an expression
like =printf("vec[2]=%d\n", vec[2]);= what is really happening is that
C is using *pointer arithmetic* to step into the array the appropriate
number of times, and reading the value in the memory location it ends
up in. So if you ask for the 3rd element of the =vec= array using
=vec[2]= then C is first looking at the location pointed to by =vec=
(the first element of the array), and stepping *two integers* forward,
and then reading the value it finds there (=vec[2]=).

The explicit way of doing this would be to use =malloc()= or
=calloc()= to allocate the array (in this case on the heap) and then
use pointer arithmetic to read off the 3rd value:

#+BEGIN_SRC C
#include <stdio.h>
#include <stdlib.h>

int main(void) {
  int *vec;
  vec = malloc(sizeof(int) * 3);
  vec[0] = 1;
  vec[1] = 2;
  vec[2] = 3;
  printf("vec[2]=%d\n", *(vec+2));
  free(vec);
  return 0;
}
#+END_SRC

The expression =*(vec+2)= essentially says, go to the location that
the pointer =vec= points to, take two steps (each step the size of an
=int=) and the read off the value you find there. How does C know the
size of each step to take? Remember when you declare a pointer, you
have to declare the type that it points to. So when we declared our
=vec= pointer, we declared it as a pointer to =int=. This means when
you use pointer arithmetic, C knows the size of each step.

The =*(vec+2)= notation is really just as a demonstration of what is
happening behind the scenes, there is rarely a need to use such an
explicit (and so difficult to read) expression to index into
arrays. The more common way of indexing into arrays (and the more
readable way) is to use the =vec[2]= notation:

#+BEGIN_SRC C
#include <stdio.h>
#include <stdlib.h>

int main(void) {
  int *vec;
  vec = malloc(sizeof(int) * 3);
  vec[0] = 1;
  vec[1] = 2;
  vec[2] = 3;
  printf("vec[2]=%d\n", vec[2]);
  free(vec);
  return 0;
}
#+END_SRC


** Pointer to a struct

Pointers can also be used to point to a struct. Here is how this would
be done:

#+BEGIN_SRC c
#include <stdio.h>
#include <stdlib.h>

typedef struct {
  int year;
  int month;
  int day;
} date;

int main(void) {

  date *today;
  today = malloc(sizeof(date));
  
  // the explicit way of accessing fields of our struct
  (*today).day = 15;
  (*today).month = 6;
  (*today).year = 2012;

  // the more readable shorthand way of doing it
  today->day = 15;
  today->month = 6;
  today->year = 2012;

  printf("the date is %d/%d/%d\n", today->day, today->month, today->year);

  free(today);
  
  return 0;
}
#+END_SRC

#+BEGIN_EXAMPLE
the date is 15/6/2012
#+END_EXAMPLE

Let's go through this step by step. On lines 4-8 we define a struct
that contains three =int= values: =year=, =month= and =day=. We use
typedef to name our new struct type =date=.

On line 12 we declare a new variable =today= to be a pointer to
=date=. On line 13 we use =malloc()= to allocate a block of memory (on
the heap) to store one =date= struct.

On lines 16-18 I show how to access fields of our =date= struct, using
explicit pointer syntax. So for example the expression =(*today).day=
means, dereference the =today= pointer and then access the =day= field
of the thing you find there (which will be a =date= struct).

On lines 21-23 I show you the more common (and more readable)
shorthand for using pointers with structs.

Just as a reminder: here is how one would do this on the stack instead
of the heap:

#+BEGIN_SRC c
#include <stdio.h>

typedef struct {
  int year;
  int month;
  int day;
} date;

int main(void) {

  date today;
  
  today.day = 15;
  today.month = 6;
  today.year = 2012;

  printf("the date is %d/%d/%d\n", today.day, today.month, today.year);

  return 0;
}
#+END_SRC

Gone is all of the pointer stuff, at least on the surface. Under the
hood, C is still using pointers to accomplish this.


