html/8_Pointers.html

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">Pointers and Arrays</h3>
<div class="outline-text-3" id="text-orgheadline4">
<p>
When you declare an array using an expression like <code>int vec[5];</code>, what
is really happening behind the scenes, is that a block of memory is
being allocated (on the stack in this case) large enough to hold 5
integers, and the <code>vec</code> variable is a pointer that points to the first
element in the array. When you index into the array with an expression
like <code>printf("vec[2]=%d\n", vec[2]);</code> what is really happening is that
C is using <b>pointer arithmetic</b> to step into the array the appropriate
number of times, and reading the value in the memory location it ends
up in. So if you ask for the 3rd element of the <code>vec</code> array using
<code>vec[2]</code> then C is first looking at the location pointed to by <code>vec</code>
(the first element of the array), and stepping <b>two integers</b> forward,
and then reading the value it finds there (<code>vec[2]</code>).
</p>

<p>
The explicit way of doing this would be to use <code>malloc()</code> or
<code>calloc()</code> to allocate the array (in this case on the heap) and then
use pointer arithmetic to read off the 3rd value:
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">void</span>) {
  <span style="color: #228b22;">int</span> *<span style="color: #a0522d;">vec</span>;
  vec = malloc(<span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">int</span>) * 3);
  vec[0] = 1;
  vec[1] = 2;
  vec[2] = 3;
  printf(<span style="color: #8b2252;">"vec[2]=%d\n"</span>, *(vec+2));
  free(vec);
  <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<p>
The expression <code>*(vec+2)</code> essentially says, go to the location that
the pointer <code>vec</code> points to, take two steps (each step the size of an
<code>int</code>) and the read off the value you find there. How does C know the
size of each step to take? Remember when you declare a pointer, you
have to declare the type that it points to. So when we declared our
<code>vec</code> pointer, we declared it as a pointer to <code>int</code>. This means when
you use pointer arithmetic, C knows the size of each step.
</p>

<p>
The <code>*(vec+2)</code> notation is really just as a demonstration of what is
happening behind the scenes, there is rarely a need to use such an
explicit (and so difficult to read) expression to index into
arrays. The more common way of indexing into arrays (and the more
readable way) is to use the <code>vec[2]</code> notation:
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">void</span>) {
  <span style="color: #228b22;">int</span> *<span style="color: #a0522d;">vec</span>;
  vec = malloc(<span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">int</span>) * 3);
  vec[0] = 1;
  vec[1] = 2;
  vec[2] = 3;
  printf(<span style="color: #8b2252;">"vec[2]=%d\n"</span>, vec[2]);
  free(vec);
  <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">Pointer to a struct</h3>
<div class="outline-text-3" id="text-orgheadline5">
<p>
Pointers can also be used to point to a struct. Here is how this would
be done:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> {
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">year</span>;
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">month</span>;
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">day</span>;
} <span style="color: #228b22;">date</span>;

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">void</span>) {

  <span style="color: #228b22;">date</span> *<span style="color: #a0522d;">today</span>;
  today = malloc(<span style="color: #a020f0;">sizeof</span>(date));

  <span style="color: #b22222;">// </span><span style="color: #b22222;">the explicit way of accessing fields of our struct</span>
  (*today).day = 15;
  (*today).month = 6;
  (*today).year = 2012;

  <span style="color: #b22222;">// </span><span style="color: #b22222;">the more readable shorthand way of doing it</span>
  today-&gt;day = 15;
  today-&gt;month = 6;
  today-&gt;year = 2012;

  printf(<span style="color: #8b2252;">"the date is %d/%d/%d\n"</span>, today-&gt;day, today-&gt;month, today-&gt;year);

  free(today);

  <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
the date is 15/6/2012
</pre>

<p>
Let's go through this step by step. On lines 4-8 we define a struct
that contains three <code>int</code> values: <code>year</code>, <code>month</code> and <code>day</code>. We use
typedef to name our new struct type <code>date</code>.
</p>

<p>
On line 12 we declare a new variable <code>today</code> to be a pointer to
<code>date</code>. On line 13 we use <code>malloc()</code> to allocate a block of memory (on
the heap) to store one <code>date</code> struct.
</p>

<p>
On lines 16-18 I show how to access fields of our <code>date</code> struct, using
explicit pointer syntax. So for example the expression <code>(*today).day</code>
means, dereference the <code>today</code> pointer and then access the <code>day</code> field
of the thing you find there (which will be a <code>date</code> struct).
</p>

<p>
On lines 21-23 I show you the more common (and more readable)
shorthand for using pointers with structs.
</p>

<p>
Just as a reminder: here is how one would do this on the stack instead
of the heap:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> {
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">year</span>;
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">month</span>;
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">day</span>;
} <span style="color: #228b22;">date</span>;

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">void</span>) {

  <span style="color: #228b22;">date</span> <span style="color: #a0522d;">today</span>;

  today.day = 15;
  today.month = 6;
  today.year = 2012;

  printf(<span style="color: #8b2252;">"the date is %d/%d/%d\n"</span>, today.day, today.month, today.year);

  <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<p>
Gone is all of the pointer stuff, at least on the surface. Under the
hood, C is still using pointers to accomplish this.
</p>
</div>
</div>
