html/8_Pointers.html


<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6">Pointers to Functions</h3>
<div class="outline-text-3" id="text-orgheadline6">
<p>
One of the handy things you can do in C, is to use a pointer to point to a function. Then you can pass this function pointer to other functions as an argument, you can store it in a struct, etc. Here is a small example:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">add</span>( <span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">b</span> ) {
  <span style="color: #a020f0;">return</span> a + b;
}

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">subtract</span>( <span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">b</span> ) {
  <span style="color: #a020f0;">return</span> a - b;
}

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">multiply</span>( <span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">b</span> ) {
  <span style="color: #a020f0;">return</span> a * b;
}

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">doMath</span>( <span style="color: #228b22;">int</span> (*<span style="color: #0000ff;">fn</span>)(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">b</span>), <span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">b</span> ) {
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">result</span> = fn(a, b);
  printf(<span style="color: #8b2252;">"result = %d\n"</span>, result);
}

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">void</span>) {

  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span> = 2;
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">b</span> = 3;

  doMath(add, a, b);
  doMath(subtract, a, b);
  doMath(multiply, a, b);

  <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<p>
Let's go through this to understand what's happening. On lines 3-5,
7-9 and 11-13, we define functions <code>add</code>, <code>subtract</code> and
<code>multiply</code>. These functions return an <code>int</code> and take two <code>int</code> values
as input arguments.
</p>

<p>
On lines 15-18 we define a function <code>doMath</code> which returns nothing
(hence <code>void</code>) and which takes three input arguments. The first input argument is:
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #228b22;">int</span> (*<span style="color: #0000ff;">fn</span>)(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">b</span>)
</pre>
</div>

<p>
This first argument is a <b>pointer to a function</b>. It's actually more
specific than that. It's a pointer to a specific kind of function: a
function that returns an <code>int</code>, and that takes two <code>int</code> values as
inputs. Let's unpack this. The <code>(*fn)</code> says this is a pointer to a
function, and we shall refer to that function as <code>fn</code>. The preceding
<code>int</code> says, it's a function that returns an <code>int</code>. The subsequent
<code>(int a, int b)</code> says it's a function that takes two <code>int</code> arguments
as inputs.
</p>

<p>
On lines 25-27, we call our <code>doMath()</code> function, each time passing it
the three input arguments that it requires. First, a pointer to a
function. Here we simply pass the <b>name</b> of one of the functions we
defined above: <code>add()</code>, <code>subtract()</code> or <code>multiply()</code>. We are permitted
to pass these functions to <code>doMath()</code> because they all satisfy the
requirements of the first input argument of <code>doMath()</code>: they all
return an <code>int</code>, and they all take two <code>int</code> values as inputs.
</p>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7">Function Arguments: Passing By Value vs Passing By Reference</h3>
<div class="outline-text-3" id="text-orgheadline7">
<p>
Typically when you think about passing arguments to functions, you
think about passing the function the <b>value</b> of some variable. A
common idiom in C however is to pass function arguments by
<b>reference</b>, using pointers. This is the case in particular with large
data structures like arrays and structs, for which it would be
inefficient to make a copy of the whole thing, and passing that copy
to a function. Instead, in passing by reference, you simply pass a
pointer to the data, to the function.
</p>

<p>
Here is some code illustrating passing by value, first:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">myFun</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">x</span>) {
  x = x * 2;
}

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">void</span>) {
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">y</span> = 50;
  printf(<span style="color: #8b2252;">"y=%d\n"</span>, y);
  myFun(y);
  printf(<span style="color: #8b2252;">"y=%d\n"</span>, y);
  <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
y=50
y=50
</pre>

<p>
In the above code example, on line 8, we assign the value <code>50</code> to the
variable <code>y</code>. Then on line 10 we call the function <code>myFun()</code> which
takes one <code>int</code> argument and we pass it our variable <code>y</code>. This is
<b>passing by value</b> since we are handing over to <code>myFun()</code> the <b>value</b>
of <code>y</code> (<code>50</code>). Within <code>myFun()</code> we multiply the argument passed to it
by <code>2</code> and exit. In <code>main()</code> when we print the value of <code>y</code>, after the
function call to <code>myFun()</code>, it is still 50 (not 100).
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">myFun</span>(<span style="color: #228b22;">int</span> *<span style="color: #a0522d;">x</span>) {
  *x = *x * 2;
}

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">void</span>) {
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">y</span> = 50;
  printf(<span style="color: #8b2252;">"y=%d\n"</span>, y);
  myFun(&amp;y);
  printf(<span style="color: #8b2252;">"y=%d\n"</span>, y);
  <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
y=50
y=100
</pre>

<p>
Here, we rewrite <code>myFun()</code> so that it take an input argument that is
not an <code>int</code>, but rather a <b>pointer to an int</b> (hence the star *
notation). Now in our <code>main()</code> function, on line 10, we pass to
<code>myFun()</code> not the value of <code>y</code> as in the previous code example, but
rather the <b>address</b> of <code>y</code>, using the <code>&amp;</code> notation. Now when
<code>myFun()</code> is called, it uses <b>pointer dereferencing</b> to multiply the
value <b>pointed to by</b> its argument <code>x</code>, by <code>2</code>. Of course <code>x</code> is
simply the <b>address</b> of <code>y</code>, which we passed to <code>myFun()</code>, and so the
value pointed to by <code>x</code> is the value that we assigned to <code>y</code>, which is
<code>50</code>. So <code>myFun()</code> multiplies that value by 2 and <b>assigns</b> it using
pointer dereferencing to <code>*x</code>, which is the value associated with <code>y</code>.
</p>

<p>
Make sure you understand these two code examples above, and why they
do different things. If you understand this, then you basically
understand pointers.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8">Dynamically Allocated Memory</h2>
<div class="outline-text-2" id="text-orgheadline8">
<p>
Languages like MATLAB, Python, etc, allow you to work with data
structures like arrays, lists, etc, that you can dynamically
resize. That is to say, you can make them longer, shorter, etc, even
after they are created. In C this is not so easy.
</p>

<p>
Once you have allocated a variable such as an array on the stack, it
is fixed in its size. You cannot make it longer or shorter. In
contrast, if you use <code>malloc()</code> or <code>calloc()</code> to allocate an array on
the heap, you can use <code>realloc()</code> to resize it at some later time. In
order to use these functions you will need to <code>#include &lt;stdlib.h&gt;</code> at
the top of your C file.
</p>

<p>
The built-in functions <code>malloc()</code>, <code>calloc()</code>, <code>realloc()</code> <code>memcpy()</code>
and <code>free()</code> are what you will use to manage dynamically allocated
data structures on the heap, "by hand". The life cycle of a heap variable involves three stages:
</p>

<ol class="org-ol">
<li>allocating the heap variable using <code>malloc()</code> or <code>calloc()</code></li>
<li>(optionally) resizing the heap variable using <code>realloc()</code></li>
<li>releasing the memory from the heap using <code>free()</code></li>
</ol>
</div>
