org/8_Pointers.org
** Allocating memory using =malloc()= or =calloc()=

These functions are used to allocate memory at runtime. The =malloc()=
function takes as input the size of the memory block to be
allocated. The =calloc()= function is like =malloc()= except that it
also initializes all elements to zero. The =calloc()= function takes
two input arguments, the number of elements and the size of each
element.

Here's an example of using =malloc()= to allocate memory to hold an
array of 10 structs:

#+BEGIN_SRC c
#include <stdio.h>
#include <stdlib.h>

typedef struct {
  int year;
  int month;
  int day;
} date;

int main(void) {

  date *mylist = malloc(sizeof(date) * 10);
  
  mylist[0].year = 2012;
  mylist[0].month = 1;
  mylist[0].day = 15;

  int i;
  for (i=1; i<10; i++) {
    mylist[i].year = 2012-i;
    mylist[i].month = 1 + i;
    mylist[i].day = 15 + i;
  }

  for (i=0; i<10; i++) {
    printf("mylist[%d] = %d/%d/%d\n", i, mylist[i].day, mylist[i].month, mylist[i].year);
  }

  free(mylist);
  return 0;
}
#+END_SRC

#+BEGIN_EXAMPLE
mylist[0] = 15/1/2012
mylist[1] = 16/2/2011
mylist[2] = 17/3/2010
mylist[3] = 18/4/2009
mylist[4] = 19/5/2008
mylist[5] = 20/6/2007
mylist[6] = 21/7/2006
mylist[7] = 22/8/2005
mylist[8] = 23/9/2004
mylist[9] = 24/10/2003
#+END_EXAMPLE

** Resizing a variable using =realloc()=

Let's say you use =calloc()= to allocate an array of 3 floating-point
values, and you later in the program want to increase the size of the
array to hold 5 values. Here's how you could do it using =realloc()=:

#+BEGIN_SRC c
#include <stdio.h>
#include <stdlib.h>

void showVec(double vec[], int n) {
  int i;
  for (i=0; i<n; i++) {
    printf("vec[%d]=%.3f\n", i, vec[i]);
  }
  printf("\n");
}

int main(void) {
  
  double *vec = calloc(3, sizeof(double));
  
  vec[1] = 3.14;
  showVec(vec, 3);

  vec = realloc(vec, sizeof(double)*5);
  showVec(vec, 5);

  vec[3] = 7.77;
  showVec(vec, 5);

  free(vec);
  return 0;
}
#+END_SRC

#+BEGIN_EXAMPLE
vec[0]=0.000
vec[1]=0.000
vec[2]=0.000

vec[0]=0.000
vec[1]=3.140
vec[2]=0.000

vec[0]=0.000
vec[1]=3.140
vec[2]=0.000
vec[3]=0.000
vec[4]=0.000

vec[0]=0.000
vec[1]=3.140
vec[2]=0.000
vec[3]=7.770
vec[4]=0.000
#+END_EXAMPLE

** Freeing a memory block using =free()=

You should always use =free()= to deallocate memory that has been
allocated with =malloc()= or =calloc()=, as soon as you don't need it
any more. Any memory allocated with =malloc()= or =calloc()= is
*reserved*, in other words, it can't be used (for good reason) until
it is deallocated with =free()=. If you fail to deallocate memory then
you will have what's called a *memory leak*. If your program uses a
lot of heap memory, that is not deallocated, and runs for a long time,
then you might find that your computer (and your program) slows down,
or suddenly freezes, or crashes, because there is no more memory to be
allocated.

The rule is, anytime you use =malloc()= or =calloc()=, you *must* also
use =free()=.


* Links

- [[http://www.youtube.com/watch?v=6pmWojisM_E][Pointer Fun with Binky]] (YouTube)
- [[http://www.youtube.com/watch?v=Rxvv9krECNw][Everything you need to know about pointers]] (YouTube)
- [[http://c.learncodethehardway.org/book/learn-c-the-hard-waych16.html#x21-7500016][Pointers Dreaded Pointers]]
- [[http://pw1.netcom.com/~tjensen/ptr/pointers.htm][A tutorial on pointers and arrays in C]]
- [[http://boredzo.org/pointers/][Everything you need to know about pointers in C]]
- [[http://cslibrary.stanford.edu/106/][Pointer Basics]]
- [[http://en.wikipedia.org/wiki/Pointer_(computer_programming)][Wikipedia: Pointer (computer programming)]]

