html/8_Pointers.html

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9">Allocating memory using <code>malloc()</code> or <code>calloc()</code></h3>
<div class="outline-text-3" id="text-orgheadline9">
<p>
These functions are used to allocate memory at runtime. The <code>malloc()</code>
function takes as input the size of the memory block to be
allocated. The <code>calloc()</code> function is like <code>malloc()</code> except that it
also initializes all elements to zero. The <code>calloc()</code> function takes
two input arguments, the number of elements and the size of each
element.
</p>

<p>
Here's an example of using <code>malloc()</code> to allocate memory to hold an
array of 10 structs:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> {
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">year</span>;
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">month</span>;
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">day</span>;
} <span style="color: #228b22;">date</span>;

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">void</span>) {

  <span style="color: #228b22;">date</span> *<span style="color: #a0522d;">mylist</span> = malloc(<span style="color: #a020f0;">sizeof</span>(date) * 10);

  mylist[0].year = 2012;
  mylist[0].month = 1;
  mylist[0].day = 15;

  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>;
  <span style="color: #a020f0;">for</span> (i=1; i&lt;10; i++) {
    mylist[i].year = 2012-i;
    mylist[i].month = 1 + i;
    mylist[i].day = 15 + i;
  }

  <span style="color: #a020f0;">for</span> (i=0; i&lt;10; i++) {
    printf(<span style="color: #8b2252;">"mylist[%d] = %d/%d/%d\n"</span>, i, mylist[i].day, mylist[i].month, mylist[i].year);
  }

  free(mylist);
  <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
mylist[0] = 15/1/2012
mylist[1] = 16/2/2011
mylist[2] = 17/3/2010
mylist[3] = 18/4/2009
mylist[4] = 19/5/2008
mylist[5] = 20/6/2007
mylist[6] = 21/7/2006
mylist[7] = 22/8/2005
mylist[8] = 23/9/2004
mylist[9] = 24/10/2003
</pre>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10">Resizing a variable using <code>realloc()</code></h3>
<div class="outline-text-3" id="text-orgheadline10">
<p>
Let's say you use <code>calloc()</code> to allocate an array of 3 floating-point
values, and you later in the program want to increase the size of the
array to hold 5 values. Here's how you could do it using <code>realloc()</code>:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">showVec</span>(<span style="color: #228b22;">double</span> <span style="color: #a0522d;">vec</span>[], <span style="color: #228b22;">int</span> <span style="color: #a0522d;">n</span>) {
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>;
  <span style="color: #a020f0;">for</span> (i=0; i&lt;n; i++) {
    printf(<span style="color: #8b2252;">"vec[%d]=%.3f\n"</span>, i, vec[i]);
  }
  printf(<span style="color: #8b2252;">"\n"</span>);
}

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">void</span>) {

  <span style="color: #228b22;">double</span> *<span style="color: #a0522d;">vec</span> = calloc(3, <span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">double</span>));

  vec[1] = 3.14;
  showVec(vec, 3);

  vec = realloc(vec, <span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">double</span>)*5);
  showVec(vec, 5);

  vec[3] = 7.77;
  showVec(vec, 5);

  free(vec);
  <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
vec[0]=0.000
vec[1]=3.140
vec[2]=0.000

vec[0]=0.000
vec[1]=3.140
vec[2]=0.000
vec[3]=0.000
vec[4]=0.000

vec[0]=0.000
vec[1]=3.140
vec[2]=0.000
vec[3]=7.770
vec[4]=0.000
</pre>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11">Freeing a memory block using <code>free()</code></h3>
<div class="outline-text-3" id="text-orgheadline11">
<p>
You should always use <code>free()</code> to deallocate memory that has been
allocated with <code>malloc()</code> or <code>calloc()</code>, as soon as you don't need it
any more. Any memory allocated with <code>malloc()</code> or <code>calloc()</code> is
<b>reserved</b>, in other words, it can't be used (for good reason) until
it is deallocated with <code>free()</code>. If you fail to deallocate memory then
you will have what's called a <b>memory leak</b>. If your program uses a
lot of heap memory, that is not deallocated, and runs for a long time,
then you might find that your computer (and your program) slows down,
or suddenly freezes, or crashes, because there is no more memory to be
allocated.
</p>

<p>
The rule is, anytime you use <code>malloc()</code> or <code>calloc()</code>, you <b>must</b> also
use <code>free()</code>.
</p>
</div>
</div>
</div>


<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12">Links</h2>
<div class="outline-text-2" id="text-orgheadline12">
<ul class="org-ul">
<li><a href="http://www.youtube.com/watch?v=6pmWojisM_E">Pointer Fun with Binky</a> (YouTube)</li>
<li><a href="http://www.youtube.com/watch?v=Rxvv9krECNw">Everything you need to know about pointers</a> (YouTube)</li>
<li><a href="http://c.learncodethehardway.org/book/learn-c-the-hard-waych16.html#x21-7500016">Pointers Dreaded Pointers</a></li>
<li><a href="http://pw1.netcom.com/~tjensen/ptr/pointers.htm">A tutorial on pointers and arrays in C</a></li>
<li><a href="http://boredzo.org/pointers/">Everything you need to know about pointers in C</a></li>
<li><a href="http://cslibrary.stanford.edu/106/">Pointer Basics</a></li>
<li><a href="http://en.wikipedia.org/wiki/Pointer_(computer_programming)">Wikipedia: Pointer (computer programming)</a></li>
</ul>
</div>
</div>
